eamars/efr32_bootloader/target/efr32/middleware/usb_gecko/src/em_usbdint.c
  if ( status != 0 )
  {
    DEBUG_USB_INT_LO_PUTS( "\nUinT" );
  }
}

/*
 * Handle port enumeration interrupt. This has nothing to do with normal
 * device enumeration.
 */
static void Handle_USB_GINTSTS_ENUMDONE( void )
{
#if ( USB_PWRSAVE_MODE )
  UsbPowerUp();
#endif

  USBDHAL_Ep0Activate( dev->ep0MpsCode );
  dev->ep[ 0 ].state = D_EP_IDLE;
  USBDHAL_EnableInts( dev );
  DEBUG_USB_INT_LO_PUTS( "EnumD" );
}

/*
 * Handle IN endpoint transfer interrupt.
 */
static void Handle_USB_GINTSTS_IEPINT( void )
{
  int epnum;
  uint16_t epint;
  uint16_t epmask;
  uint32_t status;
  USBD_Ep_TypeDef *ep;

  DEBUG_USB_INT_HI_PUTCHAR( 'i' );

  // If we came here from suspended state, set correct state
  if (USBD_GetUsbState() == USBD_STATE_SUSPENDED)
  {
    USBD_SetUsbState( dev->savedState );
  }

  epint = USBDHAL_GetAllInEpInts();
  for ( epnum = 0,                epmask = 1;
        epnum <= MAX_NUM_IN_EPS;
        epnum++,                  epmask <<= 1 )
  {
    if ( epint & epmask )
    {
      ep = USBD_GetEpFromAddr( USB_SETUP_DIR_MASK | epnum );
      status = USBDHAL_GetInEpInts( ep );

      if ( status & USB_DIEP_INT_XFERCOMPL )
      {
        USB_DINEPS[ epnum ].INT = USB_DIEP_INT_XFERCOMPL;

        DEBUG_USB_INT_HI_PUTCHAR( 'c' );

        if ( epnum == 0 )
        {
          if ( ep->remaining > ep->packetSize )
          {
            ep->remaining -= ep->packetSize;
            ep->xferred += ep->packetSize;
          }
          else
          {
            ep->xferred += ep->remaining;
            ep->remaining = 0;
          }
          USBDEP_Ep0Handler( dev );
        }
        else
        {
          ep->xferred = ep->remaining -
                        ( ( USB_DINEPS[ epnum ].TSIZ      &
                            _USB_DIEP_TSIZ_XFERSIZE_MASK    ) >>
                          _USB_DIEP_TSIZ_XFERSIZE_SHIFT          );
          ep->remaining -= ep->xferred;

          USBDEP_EpHandler( ep->addr );
#if defined( USB_DOEP0INT_STUPPKTRCVD )
          if ( USB_DINEPS[ ep->num ].INT & USB_DIEP_INT_NAKINTRPT )
          {
            USB_DINEPS[ ep->num ].INT = USB_DIEP_INT_NAKINTRPT;
          }
#endif
        }
      }
    }
  }
}

/*
 * Handle OUT endpoint transfer interrupt.
 */
static void Handle_USB_GINTSTS_OEPINT( void )
{
  int epnum;
  uint16_t epint;
  uint16_t epmask;
  uint32_t status;
  USBD_Ep_TypeDef *ep;

  DEBUG_USB_INT_HI_PUTCHAR( 'o' );

  // If we came here from suspended state, set correct state
  if (USBD_GetUsbState() == USBD_STATE_SUSPENDED)
  {
    USBD_SetUsbState( dev->savedState );
  }

  epint = USBDHAL_GetAllOutEpInts();
  for ( epnum = 0,                epmask = 1;
        epnum <= MAX_NUM_OUT_EPS;
        epnum++,                  epmask <<= 1 )
  {
    if ( epint & epmask )
    {
      ep = USBD_GetEpFromAddr( epnum );
      status = USBDHAL_GetOutEpInts( ep );

#if defined( USB_DOEP0INT_STUPPKTRCVD )
      HandleOutEpIntr( status, ep );
#else
      if ( status & USB_DOEP_INT_XFERCOMPL )
      {
        USB_DOUTEPS[ epnum ].INT = USB_DOEP_INT_XFERCOMPL;
        DEBUG_USB_INT_HI_PUTCHAR( 'c' );
        ProcessOepData( ep );
      }

      /* Setup Phase Done */
      if ( status & USB_DOEP0INT_SETUP )
      {
        ProcessSetup();
      }
#endif
    }
  }
}

#if !defined( USB_DOEP0INT_STUPPKTRCVD )
static void ProcessOepData( USBD_Ep_TypeDef *ep )
{
  if ( ep->num == 0 )
  {
    if ( ep->remaining > ep->packetSize )
    {
      ep->remaining -= ep->packetSize;
      ep->xferred += ep->packetSize;
    }
    else
    {
      ep->xferred += ep->remaining;
      ep->remaining = 0;
    }
    USBDEP_Ep0Handler( dev );
  }
  else
  {
    ep->xferred = ep->hwXferSize -
        ( ( USB_DOUTEPS[ ep->num ].TSIZ & _USB_DOEP_TSIZ_XFERSIZE_MASK )>>
          _USB_DOEP_TSIZ_XFERSIZE_SHIFT );
    ep->remaining -= ep->xferred;
    USBDEP_EpHandler( ep->addr );
  }
}
#endif

#if !defined( USB_DOEP0INT_STUPPKTRCVD )
static void ProcessSetup( void )
{
  DEBUG_USB_INT_LO_PUTS( "\nS" );

  if ( USB->DOEP0INT & USB_DOEP0INT_BACK2BACKSETUP )
  {                           /* Back to back setup packets received */
    USB->DOEP0INT = USB_DOEP0INT_BACK2BACKSETUP;
    DEBUG_USB_INT_LO_PUTS( "B2B" );

    dev->setup = (USB_Setup_TypeDef*)( USB->DOEP0DMAADDR - USB_SETUP_PKT_SIZE );
  }
  else
  {
    /* Read SETUP packet counter from hw. */
    int supCnt = ( USB->DOEP0TSIZ & _USB_DOEP0TSIZ_SUPCNT_MASK )
                 >> _USB_DOEP0TSIZ_SUPCNT_SHIFT;

    if ( supCnt == 3 )
      supCnt = 2;

    dev->setup = &dev->setupPkt[ 2 - supCnt ];
  }
  USB->DOEP0TSIZ |= 3 << _USB_DOEP0TSIZ_SUPCNT_SHIFT;
  USB->DOEP0DMAADDR = (uint32_t)dev->setupPkt;
  USB->DOEP0INT = USB_DOEP0INT_SETUP;

  USBDEP_Ep0Handler( dev );   /* Call the SETUP handler for EP0 */
}
#endif

/*
 * Handle USB reset detected interrupt in suspend mode.
 */
static void Handle_USB_GINTSTS_RESETDET  ( void )
{
#if ( USB_PWRSAVE_MODE )
  if ( ! USBD_poweredDown )
  {
    USB->GINTSTS = USB_GINTSTS_RESETDET;
  }

  if ( UsbPowerUp() )
  {
    USB->GINTSTS = USB_GINTSTS_RESETDET;
  }

#if ( USB_PWRSAVE_MODE & USB_PWRSAVE_MODE_ONVBUSOFF )
  /* Power down immediately if VBUS is off. */
  if ( ! ( USB->STATUS & USB_STATUS_VREGOS ) )
  {
    UsbPowerDown();
  }
#endif

#else
  USB->GINTSTS = USB_GINTSTS_RESETDET;
#endif /* if ( USB_PWRSAVE_MODE ) */

  if ( USB->STATUS & USB_STATUS_VREGOS )
  {
    USBD_SetUsbState( USBD_STATE_DEFAULT );
  }
  else
  {
    USBD_SetUsbState( USBD_STATE_NONE );
  }
  DEBUG_USB_INT_LO_PUTS( "RsuP\n" );
}

/*
 * Handle Start Of Frame (SOF) interrupt.
 */
static void Handle_USB_GINTSTS_SOF( void )
{
  USB->GINTSTS = USB_GINTSTS_SOF;

  if ( dev->callbacks->sofInt )
  {
    dev->callbacks->sofInt(
      ( USB->DSTS & _USB_DSTS_SOFFN_MASK ) >> _USB_DSTS_SOFFN_SHIFT );
  }
}

